Case_6/0_org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
  
    in
    {
        type fixedValue;
        value uniform (0.01 0 0);
    }

    out
    {
        
        type inletOutlet;
    	inletValue uniform (0 0 0);
    	value (0 0 0);
    }

    top
    {
        type            slip;
    }

    bottom
    {
        type            slip;
    }

    back
    {
        type            slip;
    }

    front
    {
        type            slip;
    }

    sphere_region0
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    
}

// ************************************************************************* //
